[
  {
    "class_name": "Functional",
    "config": {
      "name": "model_test1",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              45,
              80,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "full_images"
          },
          "name": "full_images",
          "inbound_nodes": []
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              45,
              80,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "objects_images"
          },
          "name": "objects_images",
          "inbound_nodes": []
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              45,
              80,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "surfaces_images"
          },
          "name": "surfaces_images",
          "inbound_nodes": []
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "features"
          },
          "name": "features",
          "inbound_nodes": []
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_3",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "name": "flatten_3",
          "inbound_nodes": [
            [
              [
                "full_images",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_4",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "name": "flatten_4",
          "inbound_nodes": [
            [
              [
                "objects_images",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_5",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "name": "flatten_5",
          "inbound_nodes": [
            [
              [
                "surfaces_images",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Concatenate",
          "config": {
            "name": "concatenate_1",
            "trainable": true,
            "dtype": "float32",
            "axis": -1
          },
          "name": "concatenate_1",
          "inbound_nodes": [
            [
              [
                "features",
                0,
                0,
                {}
              ],
              [
                "flatten_3",
                0,
                0,
                {}
              ],
              [
                "flatten_4",
                0,
                0,
                {}
              ],
              [
                "flatten_5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "output",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "output",
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "features",
          0,
          0
        ],
        [
          "full_images",
          0,
          0
        ],
        [
          "objects_images",
          0,
          0
        ],
        [
          "surfaces_images",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "output",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.7.0",
    "backend": "tensorflow"
  },
  {
    "class_name": "Functional",
    "config": {
      "name": "model_test2",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              45,
              80,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "full_images"
          },
          "name": "full_images",
          "inbound_nodes": []
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              45,
              80,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "objects_images"
          },
          "name": "objects_images",
          "inbound_nodes": []
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              45,
              80,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "surfaces_images"
          },
          "name": "surfaces_images",
          "inbound_nodes": []
        },
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "features"
          },
          "name": "features",
          "inbound_nodes": []
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_3",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "name": "flatten_3",
          "inbound_nodes": [
            [
              [
                "full_images",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_4",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "name": "flatten_4",
          "inbound_nodes": [
            [
              [
                "objects_images",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_5",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          },
          "name": "flatten_5",
          "inbound_nodes": [
            [
              [
                "surfaces_images",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Concatenate",
          "config": {
            "name": "concatenate_1",
            "trainable": true,
            "dtype": "float32",
            "axis": -1
          },
          "name": "concatenate_1",
          "inbound_nodes": [
            [
              [
                "features",
                0,
                0,
                {}
              ],
              [
                "flatten_3",
                0,
                0,
                {}
              ],
              [
                "flatten_4",
                0,
                0,
                {}
              ],
              [
                "flatten_5",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "output",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "name": "output",
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "features",
          0,
          0
        ],
        [
          "full_images",
          0,
          0
        ],
        [
          "objects_images",
          0,
          0
        ],
        [
          "surfaces_images",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "output",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.7.0",
    "backend": "tensorflow"
  }
]